#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.remote_state_bucket.random_id.this: Refreshing state... [id=WvCN]
module.logging_bucket.random_id.this: Refreshing state... [id=SssY]
module.config_bucket.random_id.this: Refreshing state... [id=aPbH]
module.hackathon_bucket.random_id.this: Refreshing state... [id=kJkL]
module.postgres_backups_bucket.random_id.this: Refreshing state... [id=Ze9c]
module.f2_debug[0].aws_iam_role_policy_attachment.this: Refreshing state... [id=f2-debug-role-20250727170731223200000001]
module.f2_debug[0].aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-2627312861]
module.f2_debug[0].aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-3882113896]
module.f2_debug[0].aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-1983736237]
module.f2_debug[0].aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-2857424922]
module.f2_debug[0].aws_iam_instance_profile.this: Refreshing state... [id=f2-debug-instance-profile]
aws_security_group_rule.allow_inbound_connections_from_f2_debug[0]: Refreshing state... [id=sgrule-299095206]
module.f2_debug[0].aws_iam_role.this: Refreshing state... [id=f2-debug-role]
module.f2_debug[0].aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-575551034]
module.f2_debug[0].aws_instance.this: Refreshing state... [id=i-0ba4437299e80d07b]
module.f2_debug[0].aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-3600939608]
module.f2_debug[0].aws_security_group.this: Refreshing state... [id=sg-04eaed584063250cd]
module.f2_debug[0].aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/f2-debug-policy]
module.f2_debug[0].aws_eip.this: Refreshing state... [id=eipalloc-0aca74a42601f6ebc]
aws_sqs_queue.expense_analysis_completions: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/558855412466/expense-analysis-completions]
module.f2_debug[0].aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-2588795282]
module.personal.aws_iam_user.this: Refreshing state... [id=alex.jackson]
module.secondary.data.aws_iam_policy_document.ec2_assume_role: Reading...
module.secondary.data.aws_iam_policy_document.ec2_assume_role: Read complete after 0s [id=2851119427]
aws_route53_zone.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0]
aws_sns_topic.expense_analysis_completions: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:expense-analysis-completions]
module.repositories["ticket-tracker"].aws_ecr_repository.this: Refreshing state... [id=ticket-tracker]
data.aws_caller_identity.current: Reading...
module.config_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-68f6c7]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
module.postgres_backups_bucket.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-65ef5c]
data.aws_caller_identity.current: Read complete after 0s [id=558855412466]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
module.database.data.aws_iam_policy_document.ec2_assume_role: Reading...
module.database.data.aws_iam_policy_document.ec2_assume_role: Read complete after 0s [id=2851119427]
module.repositories["ticket-tracker"].aws_iam_user.builder: Refreshing state... [id=ticket-tracker-builder]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
module.primary.data.aws_iam_policy_document.ec2_assume_role: Reading...
module.primary.data.aws_iam_policy_document.ec2_assume_role: Read complete after 0s [id=2851119427]
module.database.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/database-policy]
module.logging_bucket.aws_s3_bucket.this: Refreshing state... [id=logging-4acb18]
module.hackathon_bucket.aws_s3_bucket.this: Refreshing state... [id=hackathon-90990b]
aws_iam_user.configuration_deployer: Refreshing state... [id=configuration.deployer]
aws_route53_zone.forkup: Refreshing state... [id=Z06686303IG6BF3DZ1HIL]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
aws_sns_topic.outages: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:outages]
module.remote_state_bucket.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-5af08d]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
module.secondary.aws_iam_role.this: Refreshing state... [id=secondary-role]
module.personal.aws_iam_user_login_profile.this: Refreshing state... [id=alex.jackson]
module.personal.aws_iam_access_key.this: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
module.database.aws_iam_role.this: Refreshing state... [id=database-role]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
module.repositories["ticket-tracker"].aws_iam_access_key.builder: Refreshing state... [id=AKIAYEHTA3LZAHS7ZJVQ]
aws_iam_access_key.configuration_deployer: Refreshing state... [id=AKIAYEHTA3LZKXOXWTYC]
aws_iam_policy.forkup_dev_policy: Refreshing state... [id=arn:aws:iam::558855412466:policy/forkup-dev-policy]
aws_sns_topic_subscription.expense_analysis_completions: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:expense-analysis-completions:99889508-405a-4819-ad5e-d178d1865649]
aws_sns_topic_subscription.outages: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:outages:c15a0919-9e06-484e-bef6-08ab63e662d8]
module.repositories["ticket-tracker"].aws_iam_user_policy.builder: Refreshing state... [id=ticket-tracker-builder:ticket-tracker-builder-policy]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
aws_iam_role.forkup_dev: Refreshing state... [id=forkup-dev]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
module.secondary.aws_iam_instance_profile.this: Refreshing state... [id=secondary-instance-profile]
module.database.aws_iam_instance_profile.this: Refreshing state... [id=database-instance-profile]
module.database.aws_iam_role_policy_attachment.this: Refreshing state... [id=database-role-20231230120447701700000002]
module.secondary.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/secondary-policy]
module.personal.aws_iam_user_policy.this: Refreshing state... [id=alex.jackson:alex.jackson.policy]
aws_iam_role_policy_attachment.forkup_dev: Refreshing state... [id=forkup-dev-20250525170906426100000001]
module.secondary.aws_iam_role_policy_attachment.this: Refreshing state... [id=secondary-role-20250719114420150500000001]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
aws_route53_zone.internal: Refreshing state... [id=Z09687762HVZPD80UEWTJ]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
module.database.data.aws_subnet.self: Reading...
module.database.aws_ebs_volume.this: Refreshing state... [id=vol-0ac43ea68879b3895]
module.primary.data.aws_subnet.self: Reading...
module.secondary.data.aws_subnet.self: Reading...
module.secondary.aws_security_group.this: Refreshing state... [id=sg-082c1d4eb6c73a96b]
module.database.data.aws_subnet.self: Read complete after 0s [id=subnet-07936cc0e5c7d83b1]
module.database.aws_security_group.this: Refreshing state... [id=sg-0998f7db6e1ffb7eb]
module.secondary.data.aws_subnet.self: Read complete after 0s [id=subnet-07936cc0e5c7d83b1]
module.primary.data.aws_subnet.self: Read complete after 0s [id=subnet-07936cc0e5c7d83b1]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
module.postgres_backups_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-65ef5c]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
module.config_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-68f6c7]
aws_iam_user_policy.configuration_deployer: Refreshing state... [id=configuration.deployer:configuration.deployer.policy]
module.database.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-1983782041]
module.database.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-3173870365]
module.database.aws_security_group_rule.allow_inbound_postgres: Refreshing state... [id=sgrule-3465932672]
module.database.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-1306823711]
module.database.aws_instance.this: Refreshing state... [id=i-0e48bcc2a0d16252e]
module.secondary.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-3212432495]
module.secondary.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-1605379657]
module.secondary.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-3140163285]
module.secondary.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-15600419]
module.secondary.aws_instance.this: Refreshing state... [id=i-04dd6150c72ec2de3]
module.secondary.aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-3441080191]
module.secondary.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-1114985806]
module.secondary.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-560611136]
module.logging_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=logging-4acb18]
module.hackathon_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=hackathon-90990b]
aws_security_group_rule.allow_inbound_connections_from_secondary: Refreshing state... [id=sgrule-2115290846]
module.remote_state_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-5af08d]
module.database.aws_volume_attachment.this: Refreshing state... [id=vai-3516952077]
aws_route53_record.database: Refreshing state... [id=Z09687762HVZPD80UEWTJ_postgres_A]
module.secondary.aws_eip.this: Refreshing state... [id=eipalloc-0090590800db2505c]
aws_route53_record.forkup_records[""]: Refreshing state... [id=Z06686303IG6BF3DZ1HIL__A]
aws_route53_record.records[""]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0__A]
aws_route53_record.records["today"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_today_A]
aws_route53_record.records["tags"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_tags_A]
aws_route53_record.records["uptime"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_uptime_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_security_group_rule.allow_inbound_connections_from_f2_debug[0] will be destroyed
  # (because aws_security_group_rule.allow_inbound_connections_from_f2_debug is not in configuration)
  - resource "aws_security_group_rule" "allow_inbound_connections_from_f2_debug" {
      - description              = "Allow inbound connections from sg-04eaed584063250cd" -> null
      - from_port                = 5432 -> null
      - id                       = "sgrule-299095206" -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0998f7db6e1ffb7eb" -> null
      - security_group_rule_id   = "sgr-0a970b9b44cb62807" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-04eaed584063250cd" -> null
      - to_port                  = 5432 -> null
      - type                     = "ingress" -> null
    }

  # aws_security_group_rule.allow_inbound_connections_from_primary will be created
  + resource "aws_security_group_rule" "allow_inbound_connections_from_primary" {
      + description              = (known after apply)
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0998f7db6e1ffb7eb"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.f2_debug[0].aws_eip.this will be destroyed
  # (because aws_eip.this is not in configuration)
  - resource "aws_eip" "this" {
      - allocation_id            = "eipalloc-0aca74a42601f6ebc" -> null
      - association_id           = "eipassoc-094eab25032c8abc5" -> null
      - domain                   = "vpc" -> null
      - id                       = "eipalloc-0aca74a42601f6ebc" -> null
      - instance                 = "i-0ba4437299e80d07b" -> null
      - network_border_group     = "eu-west-1" -> null
      - network_interface        = "eni-0a0bc26c068ea4215" -> null
      - private_dns              = "ip-10-0-0-33.eu-west-1.compute.internal" -> null
      - private_ip               = "10.0.0.33" -> null
      - public_dns               = "ec2-34-254-74-107.eu-west-1.compute.amazonaws.com" -> null
      - public_ip                = "34.254.74.107" -> null
      - public_ipv4_pool         = "amazon" -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
      - vpc                      = true -> null
        # (3 unchanged attributes hidden)
    }

  # module.f2_debug[0].aws_iam_instance_profile.this will be destroyed
  # (because aws_iam_instance_profile.this is not in configuration)
  - resource "aws_iam_instance_profile" "this" {
      - arn         = "arn:aws:iam::558855412466:instance-profile/f2-debug-instance-profile" -> null
      - create_date = "2025-07-27T17:07:31Z" -> null
      - id          = "f2-debug-instance-profile" -> null
      - name        = "f2-debug-instance-profile" -> null
      - path        = "/" -> null
      - role        = "f2-debug-role" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
      - unique_id   = "AIPAYEHTA3LZNZQOQLWYW" -> null
        # (1 unchanged attribute hidden)
    }

  # module.f2_debug[0].aws_iam_policy.this will be destroyed
  # (because aws_iam_policy.this is not in configuration)
  - resource "aws_iam_policy" "this" {
      - arn         = "arn:aws:iam::558855412466:policy/f2-debug-policy" -> null
      - description = "Policy for f2-debug-role" -> null
      - id          = "arn:aws:iam::558855412466:policy/f2-debug-policy" -> null
      - name        = "f2-debug-policy" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::configuration-68f6c7"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::configuration-68f6c7/*"
                    },
                  - {
                      - Action   = [
                          - "route53:ListHostedZones",
                          - "route53:GetChange",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "route53:ChangeResourceRecordSets",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:route53:::hostedzone/Z03017682LQ8TW5YUFGE0",
                          - "arn:aws:route53:::hostedzone/Z06686303IG6BF3DZ1HIL",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::logging-4acb18"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::logging-4acb18/*"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::postgres-backups-65ef5c/*"
                    },
                  - {
                      - Action   = [
                          - "sns:Publish",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sns:eu-west-1:558855412466:outages"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::hackathon-90990b/*"
                    },
                  - {
                      - Action   = [
                          - "textract:AnalyzeExpense",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAYEHTA3LZPEIUMA7ZA" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
        # (1 unchanged attribute hidden)
    }

  # module.f2_debug[0].aws_iam_role.this will be destroyed
  # (because aws_iam_role.this is not in configuration)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::558855412466:role/f2-debug-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-07-27T17:07:30Z" -> null
      - description           = "Role for the f2-debug instance" -> null
      - force_detach_policies = false -> null
      - id                    = "f2-debug-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::558855412466:policy/f2-debug-policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "f2-debug-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAYEHTA3LZPYRRXMAP5" -> null
        # (2 unchanged attributes hidden)
    }

  # module.f2_debug[0].aws_iam_role_policy_attachment.this will be destroyed
  # (because aws_iam_role_policy_attachment.this is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "f2-debug-role-20250727170731223200000001" -> null
      - policy_arn = "arn:aws:iam::558855412466:policy/f2-debug-policy" -> null
      - role       = "f2-debug-role" -> null
    }

  # module.f2_debug[0].aws_instance.this will be destroyed
  # (because aws_instance.this is not in configuration)
  - resource "aws_instance" "this" {
      - ami                                  = "ami-0ab14756db2442499" -> null
      - arn                                  = "arn:aws:ec2:eu-west-1:558855412466:instance/i-0ba4437299e80d07b" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "eu-west-1a" -> null
      - cpu_core_count                       = 8 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "f2-debug-instance-profile" -> null
      - id                                   = "i-0ba4437299e80d07b" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.2xlarge" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "macbook-m2-pro" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-0a0bc26c068ea4215" -> null
      - private_dns                          = "ip-10-0-0-33.eu-west-1.compute.internal" -> null
      - private_ip                           = "10.0.0.33" -> null
      - public_dns                           = "ec2-34-254-74-107.eu-west-1.compute.amazonaws.com" -> null
      - public_ip                            = "34.254.74.107" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-07936cc0e5c7d83b1" -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null
      - tenancy                              = "default" -> null
      - user_data                            = "b7569dda709cff0f99a82c5d25c7c9ecba61c614" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-04eaed584063250cd",
        ] -> null
        # (6 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 8 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0e6c3c9edc3bd8021" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.f2_debug[0].aws_security_group.this will be destroyed
  # (because aws_security_group.this is not in configuration)
  - resource "aws_security_group" "this" {
      - arn                    = "arn:aws:ec2:eu-west-1:558855412466:security-group/sg-04eaed584063250cd" -> null
      - description            = "Security group for the f2-debug f2-instance" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow outbound HTTP to anywhere"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow outbound HTTPS to anywhere"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow outbound SSH to anywhere"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/24",
                ]
              - description      = "Allow outbound Postgres to the subnet"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
          - {
              - cidr_blocks      = [
                  - "64.227.33.121/32",
                ]
              - description      = "Allow outbound Postgres to the Digital Ocean instance"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
        ] -> null
      - id                     = "sg-04eaed584063250cd" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow inbound HTTPS from anywhere"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow inbound SSH from anywhere"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
        ] -> null
      - name                   = "f2-debug-f2-instance" -> null
      - owner_id               = "558855412466" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-0d1ab7c53aec22955" -> null
        # (1 unchanged attribute hidden)
    }

  # module.f2_debug[0].aws_security_group_rule.allow_inbound_https will be destroyed
  # (because aws_security_group_rule.allow_inbound_https is not in configuration)
  - resource "aws_security_group_rule" "allow_inbound_https" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow inbound HTTPS from anywhere" -> null
      - from_port              = 443 -> null
      - id                     = "sgrule-3882113896" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-04eaed584063250cd" -> null
      - security_group_rule_id = "sgr-016400b7ca45e7248" -> null
      - self                   = false -> null
      - to_port                = 443 -> null
      - type                   = "ingress" -> null
    }

  # module.f2_debug[0].aws_security_group_rule.allow_inbound_ssh will be destroyed
  # (because aws_security_group_rule.allow_inbound_ssh is not in configuration)
  - resource "aws_security_group_rule" "allow_inbound_ssh" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow inbound SSH from anywhere" -> null
      - from_port              = 22 -> null
      - id                     = "sgrule-2627312861" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-04eaed584063250cd" -> null
      - security_group_rule_id = "sgr-0e3b6449cfe1e1b75" -> null
      - self                   = false -> null
      - to_port                = 22 -> null
      - type                   = "ingress" -> null
    }

  # module.f2_debug[0].aws_security_group_rule.allow_outbound_http will be destroyed
  # (because aws_security_group_rule.allow_outbound_http is not in configuration)
  - resource "aws_security_group_rule" "allow_outbound_http" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow outbound HTTP to anywhere" -> null
      - from_port              = 80 -> null
      - id                     = "sgrule-1983736237" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-04eaed584063250cd" -> null
      - security_group_rule_id = "sgr-0e6087b635b0344a8" -> null
      - self                   = false -> null
      - to_port                = 80 -> null
      - type                   = "egress" -> null
    }

  # module.f2_debug[0].aws_security_group_rule.allow_outbound_https will be destroyed
  # (because aws_security_group_rule.allow_outbound_https is not in configuration)
  - resource "aws_security_group_rule" "allow_outbound_https" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow outbound HTTPS to anywhere" -> null
      - from_port              = 443 -> null
      - id                     = "sgrule-3600939608" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-04eaed584063250cd" -> null
      - security_group_rule_id = "sgr-03bb5877b54a41b08" -> null
      - self                   = false -> null
      - to_port                = 443 -> null
      - type                   = "egress" -> null
    }

  # module.f2_debug[0].aws_security_group_rule.allow_outbound_postgres will be destroyed
  # (because aws_security_group_rule.allow_outbound_postgres is not in configuration)
  - resource "aws_security_group_rule" "allow_outbound_postgres" {
      - cidr_blocks            = [
          - "64.227.33.121/32",
        ] -> null
      - description            = "Allow outbound Postgres to the Digital Ocean instance" -> null
      - from_port              = 5432 -> null
      - id                     = "sgrule-2857424922" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-04eaed584063250cd" -> null
      - security_group_rule_id = "sgr-0c51fdc3af217c477" -> null
      - self                   = false -> null
      - to_port                = 5432 -> null
      - type                   = "egress" -> null
    }

  # module.f2_debug[0].aws_security_group_rule.allow_outbound_ssh will be destroyed
  # (because aws_security_group_rule.allow_outbound_ssh is not in configuration)
  - resource "aws_security_group_rule" "allow_outbound_ssh" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow outbound SSH to anywhere" -> null
      - from_port              = 22 -> null
      - id                     = "sgrule-2588795282" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-04eaed584063250cd" -> null
      - security_group_rule_id = "sgr-0e3b6449cfe1e1b75" -> null
      - self                   = false -> null
      - to_port                = 22 -> null
      - type                   = "egress" -> null
    }

  # module.f2_debug[0].aws_security_group_rule.allow_outbound_subnet_postgres will be destroyed
  # (because aws_security_group_rule.allow_outbound_subnet_postgres is not in configuration)
  - resource "aws_security_group_rule" "allow_outbound_subnet_postgres" {
      - cidr_blocks            = [
          - "10.0.0.0/24",
        ] -> null
      - description            = "Allow outbound Postgres to the subnet" -> null
      - from_port              = 5432 -> null
      - id                     = "sgrule-575551034" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-04eaed584063250cd" -> null
      - security_group_rule_id = "sgr-07c80517a05340fdd" -> null
      - self                   = false -> null
      - to_port                = 5432 -> null
      - type                   = "egress" -> null
    }

  # module.primary.aws_eip.this will be created
  + resource "aws_eip" "this" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = (known after apply)
    }

  # module.primary.aws_iam_instance_profile.this will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "primary-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "primary-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.primary.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn         = (known after apply)
      + description = "Policy for primary-role"
      + id          = (known after apply)
      + name        = "primary-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::configuration-68f6c7"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::configuration-68f6c7/*"
                    },
                  + {
                      + Action   = [
                          + "route53:ListHostedZones",
                          + "route53:GetChange",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "route53:ChangeResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:route53:::hostedzone/Z03017682LQ8TW5YUFGE0",
                          + "arn:aws:route53:::hostedzone/Z06686303IG6BF3DZ1HIL",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::logging-4acb18"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::logging-4acb18/*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::postgres-backups-65ef5c/*"
                    },
                  + {
                      + Action   = [
                          + "sns:Publish",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sns:eu-west-1:558855412466:outages"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::hackathon-90990b/*"
                    },
                  + {
                      + Action   = [
                          + "textract:AnalyzeExpense",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.primary.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role for the primary instance"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "primary-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.primary.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "primary-role"
    }

  # module.primary.aws_instance.this will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0ab14756db2442499"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "primary-instance-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "macbook-m2-pro"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-07936cc0e5c7d83b1"
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "a868e7afe255e25f1052a99dd7ecd381d3613c10"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.primary.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for the primary f2-instance"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "primary-f2-instance"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0d1ab7c53aec22955"
    }

  # module.primary.aws_security_group_rule.allow_inbound_https will be created
  + resource "aws_security_group_rule" "allow_inbound_https" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow inbound HTTPS from anywhere"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.primary.aws_security_group_rule.allow_inbound_ssh will be created
  + resource "aws_security_group_rule" "allow_inbound_ssh" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow inbound SSH from anywhere"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.primary.aws_security_group_rule.allow_outbound_http will be created
  + resource "aws_security_group_rule" "allow_outbound_http" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow outbound HTTP to anywhere"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # module.primary.aws_security_group_rule.allow_outbound_https will be created
  + resource "aws_security_group_rule" "allow_outbound_https" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow outbound HTTPS to anywhere"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.primary.aws_security_group_rule.allow_outbound_postgres will be created
  + resource "aws_security_group_rule" "allow_outbound_postgres" {
      + cidr_blocks              = [
          + "64.227.33.121/32",
        ]
      + description              = "Allow outbound Postgres to the Digital Ocean instance"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "egress"
    }

  # module.primary.aws_security_group_rule.allow_outbound_ssh will be created
  + resource "aws_security_group_rule" "allow_outbound_ssh" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow outbound SSH to anywhere"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "egress"
    }

  # module.primary.aws_security_group_rule.allow_outbound_subnet_postgres will be created
  + resource "aws_security_group_rule" "allow_outbound_subnet_postgres" {
      + cidr_blocks              = [
          + "10.0.0.0/24",
        ]
      + description              = "Allow outbound Postgres to the subnet"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "egress"
    }

Plan: 15 to add, 0 to change, 15 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>